/*
	2차원 배열: 첨자를 2개 가지고 있는 배열 -> 다차원ㄴ배열
	1. 선언
		자료형 배열명[첨자1][첨자2]; 첨자1 = 행, 첨자 2 = 열
	2. 행렬
		
		
*/

#include<stdio.h>

int main() {
	int x[2][3];
	//int y[2][3] = { 1,2,3,4,5,6 };
	//int z[2][3] = { {1,2,3}, {4,5,6} };
	//int w[][3] = { 1,2,3,4,5,6 }; //생략 가능;

	int a[6] = { 1,2,3,4,5,6 };
	x[0][0] = 1;
	x[0][1] = 2;
	x[0][2] = 3;
	x[1][0] = 4;
	x[1][1] = 5;
	x[1][2] = 6;

	for (int i = 0; i < 6; i++) {
		printf("a[%d] = %d\n", i, a[i]);
	}

	for (int j = 0; j < 2; j++){
		for (int k = 0; k < 3; k++) {
			printf("x[%d][%d] = %d\n", j,k, x[j][k]);
		}
	}


	return 0;
}